---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.TabbedDialogExtension
source: html/ab503ddc-6f70-01bf-eccb-15d6ce27bf14.htm
---
# TabbedDialogExtension Members

Constructs a extension instance with a control and ok action handler.